Enums/ВариантыОтраженияКорректировокРеализаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Enum>
		<Properties>
			<Name>ВариантыОтраженияКорректировокРеализаций</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОтразитьНаПрочихДоходах</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СписатьНаРасходы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УвеличитьВыручку</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УвеличитьРеализациюУменьшитьСкладскиеОстатки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УвеличитьРеализациюУчестьПриИнвентаризации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УменьшитьВыручку</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УменьшитьРеализациюУвеличитьСкладскиеОстатки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УменьшитьРеализациюУчестьПриИнвентаризации</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВариантыОтраженияКорректировокРеализаций/Forms/ФормаВыбора/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;

	ТекстПояснения = "";
	
	Если Параметры.Отбор.Свойство("Ссылка")
	 И ТипЗнч(Параметры.Отбор.Ссылка) = Тип("СписокЗначений") Тогда
	 	
	 	ДоступныеВарианты = Параметры.Отбор.Ссылка;
		Если ДоступныеВарианты.НайтиПоЗначению(Перечисления.ВариантыОтраженияКорректировокРеализаций.УвеличитьРеализациюУчестьПриИнвентаризации) <> Неопределено Тогда
			ТекстПояснения = НСтр("ru='Количество товара по документу больше. Используется ордерная схема при отражении излишков и недостач.'") + Символы.ПС + Символы.ПС;
		ИначеЕсли ДоступныеВарианты.НайтиПоЗначению(Перечисления.ВариантыОтраженияКорректировокРеализаций.УвеличитьРеализациюУменьшитьСкладскиеОстатки) <> Неопределено Тогда
			ТекстПояснения = НСтр("ru='Количество товара по документу больше. Не используется ордерная схема при отражении излишков и недостач.'") + Символы.ПС + Символы.ПС;
		ИначеЕсли ДоступныеВарианты.НайтиПоЗначению(Перечисления.ВариантыОтраженияКорректировокРеализаций.УменьшитьРеализациюУчестьПриИнвентаризации) <> Неопределено Тогда
			ТекстПояснения = НСтр("ru='Количество товара по документу меньше. Используется ордерная схема при отражении излишков и недостач.'") + Символы.ПС + Символы.ПС;
		ИначеЕсли ДоступныеВарианты.НайтиПоЗначению(Перечисления.ВариантыОтраженияКорректировокРеализаций.УменьшитьРеализациюУвеличитьСкладскиеОстатки) <> Неопределено Тогда
			ТекстПояснения = НСтр("ru='Количество товара по документу меньше. Не используется ордерная схема при отражении излишков и недостач.'") + Символы.ПС + Символы.ПС;
		КонецЕсли;
		
	КонецЕсли;
	
	ТекстПояснения = ТекстПояснения + НСтр("ru='Выберите вариант отражения расхождений:'");
	
КонецПроцедуры

#КонецОбласти
